app/controllers/crawl_requests_controller.rb

  def create
    @crawl_request = CrawlRequest.new(params[:crawl_request])
    @crawl_request.urls.build(params[:crawl_request][:urls_attributes])
    if @crawl_request.save
---
INSERT INTO "crawl_requests" ("created_at", "source", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-15 05:09:19.166605"], ["source", "postman"], ["updated_at", "2015-06-15 05:09:19.166605"]]
INSERT INTO "urls" ("crawl_request_id", "created_at", "updated_at", "url_text") VALUES (?, ?, ?, ?)  [["crawl_request_id", 18], ["created_at", "2015-06-15 05:19:43.371434"], ["updated_at", "2015-06-15 05:19:43.371434"], ["url_text", "foo"]]